/*:
 # 目次
 */
// MARK: Agenda1
// コマンドラインアプリケーションのプロジェクトには、main.swift ファイルが準備されている。
// main.swift ファイルがプログラム実行時の起点(main entry point)になる。

// MARK: Agenda2
// print()機能、機能を呼び出す構文、()の間に引数を渡すこと、"による文字列リテラルについて説明する。


// MARK: Agenda3
// 数値リテラル、型アノテーション、変数の宣言と初期化について説明する
// 単行コメントの使い方を説明する


// MARK: Agenda4
// Swiftの文字列埋め込みを理解する


// MARK: Agenda5
// Swift において、型アノテーションは必須ではないことを説明する
// Swift が、初期化の際に代入される値の種類を調べて、変数のデータ型を推論していることを説明する


// MARK: Agenda6
// プログラム実行中に numberOfPlanets と diameterOfEarth の値が変化しないことを理解する
// var と let キーワードで、変数と定数が異なることを説明する


// MARK: Agenda7
// let キーワードで定数を宣言して、後から変数にすることが Swift のベストプラクティスであることを理解する
// "いつでも定数ではじめる" ことを勧める


/*:
 1. [`文字列をコンソール出力する`](page1)
 2. [`変数オブジェクトを宣言する`](page2)
 3. [`数字と数値の違い`](page3)
 4. [`データ型を調べる`](page4)
 5. [`型アノテーションを使って宣言する`](page5)
 6. [`文字列にオブジェクトを埋め込む`](page6)
 7. [`値を更新できない変数`](page7)
 */
