//: [前のページへ](@previous)
/*:
 # 挨拶メッセージを出力する
 */
/*:
 ## メッセージをつくろう
 メッセージを表示して挨拶するプログラムを考える
 挨拶の言葉は `Hello, world!` にする
 プログラムを書いてみる
 
 ````
 Hello, world!
 ````
 これは、エラーになる\
 プログラム中に扱いたい言葉は `"` ダブルクォートで囲まなければいけない。
 修正して、実行すると...
 
 ````
 "Hello, world!"
 ````
 右側に実行結果が表示される。（リザルトサイドバー）
 */
"Hello, world!"



/*:
 `"` で囲まれた値のことを `文字列` という。
 */
/*:
 ## コンソール出力する
 実行結果とは別に、ユーザと対話するために値を表示することを `出力` という。\
 値を出力するには `print()` 機能を使う。\
 `()` の中に、メッセージを入れてみる。
 
 ````
 print("Hello, world!")
 ````
 実行すると...\
 Xcode ウィンドウ下部に出力された。\
 このプログラムの実行結果を表示する場所を `コンソール` と呼ぶ。\
 */
print("Hello, world!")



/*:
 `コンピュータからユーザ` に対する会話ができた。
 */
//: [次のページへ](@next)
